{"meta":{"title":"Snowme34's blog","subtitle":null,"description":"A blog of a developer","author":"snowme34","url":"https://blog.snowme34.com"},"pages":[{"title":"Not Found","date":"2018-09-18T20:13:01.328Z","updated":"2018-09-18T20:13:01.328Z","comments":false,"path":"404.html","permalink":"https://blog.snowme34.com/404.html","excerpt":"","text":"Sorry, wrong link (╥_╥)Please try to fix the link or search in this site!The search bar is on the left corner for desktop and on the top for mobile."},{"title":"Categories","date":"2018-09-17T22:56:09.066Z","updated":"2018-09-17T22:56:09.066Z","comments":false,"path":"categories/index.html","permalink":"https://blog.snowme34.com/categories/index.html","excerpt":"","text":""},{"title":"About","date":"2018-09-19T07:31:36.692Z","updated":"2018-09-19T07:31:36.692Z","comments":false,"path":"about/index.html","permalink":"https://blog.snowme34.com/about/index.html","excerpt":"","text":"Undergraduate student of computer science.ExperiencesNational Olympiad in Informatics in Provinces 2017 Second PriceVice-minister of Publicity Department 2016-2017Joined many other hackthons and programing competitionsSkillsCSLanguagesC/C++JavapythonbashARM AssemblyLinuxGraphic DesignPhotoshopMovie EditingAdobe PremierHuman LanguagesChineseEnglishJapanese (passed N4 test)InterestsSportsFree-climbingSwimmingMusicErhu (Chinese traditional music instrument)Photography经历2017年 奥林匹克省级信息竞赛 2等奖2016-2017年 校学生会宣传部副部长技能CS语言C/C++JavapythonbashARM 汇编语言Linux平面设计Photoshop视频剪辑Adobe Premier人类语言汉语英语日语 (通过 N4)兴趣体育攀岩游泳音乐二胡摄影注：本站不同语言部分并不都是翻译，有可能包含不同的内容。Notice: The parts written in different languages are not necessarily translations. They may contain different contents.Social links are not available currently. This page needs further editing."},{"title":"Repositories","date":"2018-09-15T18:19:48.979Z","updated":"2018-09-15T18:19:48.979Z","comments":false,"path":"repository/index.html","permalink":"https://blog.snowme34.com/repository/index.html","excerpt":"","text":""},{"title":"test","date":"2018-09-18T19:01:58.026Z","updated":"2018-09-18T19:01:58.026Z","comments":false,"path":"test.html","permalink":"https://blog.snowme34.com/test.html","excerpt":"","text":"Hellojust a test page ^_^"},{"title":"Tags","date":"2018-09-17T22:57:07.496Z","updated":"2018-09-17T22:57:07.496Z","comments":false,"path":"tags/index.html","permalink":"https://blog.snowme34.com/tags/index.html","excerpt":"","text":""}],"posts":[{"title":"No Scary Git","slug":"no-scary-git","date":"2018-04-10T05:31:43.000Z","updated":"2018-09-19T07:28:29.620Z","comments":true,"path":"post/no-scary-git/","link":"","permalink":"https://blog.snowme34.com/post/no-scary-git/","excerpt":"","text":"All you need to know to work on Github with very small team in 3 min.Sign upJoin GitHubCreate RepoCreate a new repositoryGive repo name. Can be changed later.PublicAnyone can seePrivateYou control who can seeREADMEThe first page people see when open your repo. Usually in MarkdownInviterepo’s settings -&gt; Collaborator -&gt; [type Github account] -&gt; invite(optional) copy invite link(or create one: https://github.com/[Your User Name]/[Your Repo Name]/invitations)JoinClick the invitation linkFetch files from Github to local1git clone https://github.com/[Your User Name]/[Your Repo Name].gitIf you are not owner or collaborator, you need to fork the repo and clone from your repo.If you just want to download other’s repo, use their “.git” link found in Clone or download, the big green button.Edit filesUse your editor.Save the changes (commit)Commit is to “save your changes”.One reason why we use git is because it can revert changes and it separates “your currently working tree” and “committed files” that are stored in “.git” folder.(in the root dir of the repo in your local)12git add .git commit -m \"[A Message for this commit]\"“git add .” actually “stages” the files. But you don’t need to know the difference right now.Upload your changes1git push origin masterorigin is the upstream.master is the name of the branch you are working on.If you are owner of collaborators, you can choose to make the change instantly (you have other choices in settings).If you are not, you need to push to your repo and create a Pull Request in the original repo to actually contribute your changes.Download Changes of Other People1git pull originStart from LocalInitialize an empty local git repo1git initMaybe you also need to set the upstream too. Just follow the instruction.Best Friend1git help [command]External Linksgit - the simple guide - no deep shit!Pro GitGit 指南","categories":[{"name":"Notes","slug":"Notes","permalink":"https://blog.snowme34.com/categories/Notes/"},{"name":"Programming Basis","slug":"Notes/Programming-Basis","permalink":"https://blog.snowme34.com/categories/Notes/Programming-Basis/"}],"tags":[{"name":"Tutorial","slug":"Tutorial","permalink":"https://blog.snowme34.com/tags/Tutorial/"},{"name":"Git","slug":"Git","permalink":"https://blog.snowme34.com/tags/Git/"}]},{"title":"Rebuilding My Website","slug":"rebuild-note","date":"2018-03-24T14:27:02.000Z","updated":"2018-09-19T07:28:37.718Z","comments":true,"path":"post/rebuild-note/","link":"","permalink":"https://blog.snowme34.com/post/rebuild-note/","excerpt":"","text":"Background StoryThis is a sad story. It has been a while since my last website (a WordPress run on VPS) “vanished”. I doubt it was due to misconfiguration of Debian’s crontab I used to auto refresh the ssl certificate or something like that. I think I will post something like the Nginx config of it later on my blog.Ever since then have I had little time or energy to rebuild it, or more precisely, to maintain it. It is very tempting to use the WordPress again since it is so easy to make it run and so popular and so easy to find plugins. But the thing is, running on a VPS means it depends on some unstable services. When the VPS provider reboots the server, it is sometimes required to manually reboot Nginx service (or reload ssl keys refreshed by the bot of Let’s Encrypt. Their bot was still beta at that time). And it is also very hard to maintain due to the cost of the VPS itself and other problems too.So I decided to make use of Github Pages. It looks like I need to start from the scratch again: to buy a new domain since the old one was ugly and hard to remember, to configure the DNS, to reconfigure Zoho emails (I had 10 different emails for my old domain to register on different websites), to choose the theme of the blog, to decide the structure of the whole website etc. (I tried to use Readthedocs for my wiki page, the page for all of my pure notes, and struggled to “fix” the package requirements for different versions of python of their codes sad face)Long story short. Let’s dive into the main point of this post!Process of setting up hexoNote: the following notes was written as a comprehensive tutorial.Setting up environmentPrerequisites:Github accountGo to Github and sign upGithub Page repositoryAt least one repository to store the generated website on Github is required. Just go to your Github home page and create a new repository following the instruction. You can either create it as a public or private repo. Other people cannot see the content of your private repo but since your Github page will be published you website will eventually be public.There is a little trick here. If you name your repo as “YOUR_GITHUB_USER_NAME.github.io”, then your Github Page will automatically be published with that URL. Please read the documentation for more details.npmhexoIn brief, install npm, hexo and create a Github repo.That is almost all you need to host a website on Github for free! You don’t need to worry about SSL, don’t need to pay the fees for renting a server. So awesome thanks to Github!StructureLike I said before, previously I had different subdomains for different purposes. I had wiki, blog, me, doc, etc. And I used one simple page as the whole “site map” for all of them.Same thing again for me.Other choices may include:use one and only one website for the bloguse hexo as a “show off” page to “show off” the frontend skills (something like a portfolio)use Github Pages as a website to host demo web applicationsand many many more!Choosing theme for hexoSince I use hexo for most of my web sites, it’s crucial to have a pretty and fit theme. You can surely create your own theme too!Place for you to seek for hexo themes.Potential blog theme:simple-blackicarusPotential wiki theme:docPotential moe theme:galPotential “show off” theme:hollowInitialize a local hexo folderPlease refer to the official hexo documentation for further details.open terminal in your ideal directoryFor windows, for example, winkey + r and rum cmd. cd \\d “path to directory”.type the following command to generate the initial hexo folder1hexo initcustomize _config.yml to meet personal needFor example, change the name of the site, change the theme and so on.config _config.yml to use git to publish the website1234deploy: type: git repository: https://github.com/YOUR_GITHUB_USER_NAME/YOUR_REPO_FOR_THIS_SITE.git branch: masteradd a post for our website to have something to showHexo will give provide us with a “hello world” post. Feel free to delete it.Register a domainCompare different domain name service providers.There is a cool website called domcompPay highly attention to the different prices of buying a new one and renewing an old one and transferring domain to another provider.Some general tips: Search for coupons first. For instance, one can use “PRIVACYPLEASE” to have free privacy on name.com.I don’t feel like posting my personal opinion about which one is better here, however.Github Page domain settingPlease read the official Github tutorial for further detailsadd customized subdomain to correspondent Github page settingschange CNAME record of DNS providerdon’t forget to add CNAME file to your hexo “source” folder or hexo will delete the CNAME config of Github Page. Or you could try to add the following line to the “deploy” of hexo config link to document: (note the grammar of yaml)1delete: falsePublishgenerate the website1hexo generateor you can also use1hexo gmake sure you set up the git deploy config properlydeploy your website generated by hexo1hexo deployor you can also use1hexo dProcess of rebuild the siteIt looks like we have some website running. But where are the contents?Sign up for a image host to hold the picturesI have no idea if this is necessary or not for Github Pages. For VPS, in order to have better speed to load the pictures and to save storage, it is generally preferred to not save the pictures directly on your own server but on an image host.You can try imgur and follow the instructions!Re-upload the old postsEdit and update old posts!Reference linksAll the documentations mentioned abovehttp://chuangzaoshi.com/operatehttps://www.v2ex.com/t/331613","categories":[{"name":"Notes","slug":"Notes","permalink":"https://blog.snowme34.com/categories/Notes/"},{"name":"Web-hosting","slug":"Notes/Web-hosting","permalink":"https://blog.snowme34.com/categories/Notes/Web-hosting/"}],"tags":[{"name":"Tutorial","slug":"Tutorial","permalink":"https://blog.snowme34.com/tags/Tutorial/"},{"name":"Web-hosting","slug":"Web-hosting","permalink":"https://blog.snowme34.com/tags/Web-hosting/"}]},{"title":"Modest Informal Password Advice","slug":"advice","date":"2018-03-22T07:00:00.000Z","updated":"2018-09-19T07:23:51.930Z","comments":true,"path":"post/advice/","link":"","permalink":"https://blog.snowme34.com/post/advice/","excerpt":"","text":"个人对于密码设置的建议本文只是个人建议，仅供参考，写出来主要给自己留个note其实写这个原因是没多少人写这里先简单说一下密码是怎么破解的。首先破解者能够访问输入用户名和密码的地方，要先找到门口。第一层防御就是隐藏这个访问点。对于端口，可以调高指定端口，但是所有端口只有6万个，很快就能扫描完成。对于网页，就可以用一些特殊地址掩盖真实的登陆页面。对于wifi，可以禁止SSID广播。这时需要一个用户名和一个密码。用户名在许多情况下都是注册时候用的邮箱地址。为了在这一个地方防御住，需要用非通用邮箱注册。包括但不限于域名邮箱地址，一次性邮箱地址。花花绿绿的hello@abc.xyz这样的域名邮箱听起来很神奇，看起来很神奇，其实很简单。简单的话可以去域名商购买一个低价冷门域名，然后forward到真实的邮箱。还可以去zoho这样的地方得到。当然一般情况下都是知道用户名才会去尝试破解。密码一般都是暴力破解。注：破解密码和盗取密码不一样。如有些古老的网站会把密码用明文传输，直接抓包就行了。为了从最有可能的密码开始尝试，可以用字典，彩虹表等。简单来讲就是最常见密码放在一起。例如生日，每年只有12个月，每个月只有30天左右，从当前日期往回倒退猜也不会有无限年份，用纯生日做密码是及其危险的。想一想有多少人把aabbccdd作为wifi密码。当然如果密码泄露了，比如在坏坏的公共wifi登陆并进行危险操作，就不用暴力破解了。防止暴力破解可以试试添加尝试次数上限（这取决于网络服务提供商）和两步验证。为了让其前功尽弃，还是经常改密码比较安全。正文Step 1. 生成一个纯随机文本到了暴力破解这一步，只是一个时间问题。可以参考一下这两个暴力破解表格：暴力破解时间表格1，暴力破解时间表格2。为了让你的密码能够坚持到被暴力破解这一个步骤，不在字典攻击就被拿下，你需要一个纯随机的文本作为密码。你可以自己写一个随机文本产生器，也可以用计算器自带的，也可以去应用商城下载一个。这里推荐random网站提供的随机密码生成。当然在大多数情况下，为了方便记忆，你还是可以自己想出一个接近于纯随机的密码。 可以弄一个西班牙语单词和汉语拼音的混合体，中间再加点你最喜欢的化学元素的中子数和标点符号。Step 2. 改编这个纯随机文本费了这么大劲得到的一个纯随机文本，光记住都要再花一些时间，怎么能直接就用作密码呢？（大雾，为了安全，在最重要的地方还是完全没有使用过的纯随机密码保险）可以试试在这个随机文本前面或者后面加上密码用途的标识符（如笔记就是ThoSto（thought store，思想存储，这样奇怪的东西反而好记也不好被猜到）），这个标识符可以用在你所有跟笔记有关的账户上，但尽量不要重复，可以改大小写和添加标点符号。然后在密码主题的后面加上你所注册的账户的唯一标识符，如印象笔记就是ImpLike（Impression印象，Like像），最后再随便加几个标点符号，如在ImpLike之间加一个下划线，在最后加一个感叹号之类的。比较有特色的可以把这个网站名字读50遍，然后把嘴里发出的那个音用拼音写下来当结尾。每次设置新密码的时候可以把这3各部分的位置互换。好了，现在最大的问题就是密码太长了，有些网站无法注册，裁剪即可。Step 3. 使用这个强密码在注册新账户的时候在密码一栏填写就可以了。也可以把现有账户的密码改成这个。当然也可以直接使用lastpass这样的软件、浏览器插件。这里也推荐用该类软件保存非重要网站、账户的密码。强烈推荐keepass和面向Linux桌面的keepassxc.注意存放这个密码。网络安全最大的漏洞都是来源于使用者。都知道要改默认PIN，但事实上机会没有人会记得去改它。注：此文不是对于保护上网隐私的描述。也不是防御网络攻击的描述。注：本文为简单记叙文，内容没有经过严格验证。","categories":[{"name":"Notes","slug":"Notes","permalink":"https://blog.snowme34.com/categories/Notes/"}],"tags":[{"name":"zh-CN","slug":"zh-CN","permalink":"https://blog.snowme34.com/tags/zh-CN/"},{"name":"Notes","slug":"Notes","permalink":"https://blog.snowme34.com/tags/Notes/"}]},{"title":"Shakespeare Sonnet 18 Chinese Translation","slug":"Sonnet-18-zh-CN-translation","date":"2018-03-22T06:49:40.000Z","updated":"2018-09-19T07:29:33.189Z","comments":true,"path":"post/Sonnet-18-zh-CN-translation/","link":"","permalink":"https://blog.snowme34.com/post/Sonnet-18-zh-CN-translation/","excerpt":"","text":"Sonnet 18作者：莎士比亚 William Shakespeare翻译：snowme34非商业转载请标明出处，商业转载请联系作者获得授权Shall I compare thee to a summer’s day?我能，把你比作一个夏天吗？Thou art more lovely and more temperate:可你，却更可爱而又更纤婉:Rough winds do shake the darling buds of May,暴风，摇曳着五月的娇柔花蔓，And summer’s lease hath all too short a date:夏止，默默离去之间的悄然:Sometime too hot the eye of heaven shines,时时，天堂的光辉金迷纸醉，And often is his gold complexion dimm’d;看吧，他高贵的面容已日渐憔悴;And every fair from fair sometime declines,即是，雍容之物终将会破碎，By chance, or nature’s changing course, untrimm’d;只因，偶然亦或是自然之愧；But thy eternall summer shall not fade,但是，永恒之夏绝不凋零，Nor loose possession of that fair thou ow’st;也不，不愿失去珍贵感情;Nor shall Death brag thou wander’st in his shade,亦无，无人手持镰斧之柄，When in eternal lines to time thou grow’st:而当一切，恒如此诗此时:So long as men can breathe, or eyes can see,恒如，生灵之吐息之执，恒如，视界之尽头之尺，So long lives this, and this gives life to thee.恒如，生之所生，恒如，你亘古的美丽。","categories":[{"name":"Literature","slug":"Literature","permalink":"https://blog.snowme34.com/categories/Literature/"},{"name":"Translations","slug":"Literature/Translations","permalink":"https://blog.snowme34.com/categories/Literature/Translations/"}],"tags":[{"name":"Shakespeare","slug":"Shakespeare","permalink":"https://blog.snowme34.com/tags/Shakespeare/"},{"name":"zh-CN","slug":"zh-CN","permalink":"https://blog.snowme34.com/tags/zh-CN/"},{"name":"Literature","slug":"Literature","permalink":"https://blog.snowme34.com/tags/Literature/"},{"name":"Original","slug":"Original","permalink":"https://blog.snowme34.com/tags/Original/"}]}]}